Niklaus1911/esp32-meteo/src/main.cpp
void publishHomeAssistantDiscovery();
void flushMqtt(uint32_t durationMs);
void waitForRetainedStayAwakeCommand();
BatteryCurve activeBatteryCurve();

void logPhase(const char* phase) {
  Serial.println();
  Serial.printf("== %s ==\n", phase);
}

const char* yesNo(bool value) {
  return value ? "yes" : "no";
}

bool formatInto(char* buffer, size_t bufferSize, const char* description, const char* format, ...) {
  va_list args;
  va_start(args, format);
  const int written = vsnprintf(buffer, bufferSize, format, args);
  va_end(args);

  if (written < 0) {
    Serial.printf("Formatting failed for %s\n", description);
    return false;
  }
  if (static_cast<size_t>(written) >= bufferSize) {
    Serial.printf("Formatting truncated for %s: needed %u bytes, buffer has %u bytes\n",
                  description,
                  static_cast<unsigned int>(written + 1),
                  static_cast<unsigned int>(bufferSize));
    return false;
  }
  return true;
}

bool appendChecked(char* destination, size_t destinationSize, const char* description, const char* value) {
  const size_t used = strlen(destination);
  const size_t valueLength = strlen(value);
  if (used + valueLength >= destinationSize) {
    Serial.printf("Formatting truncated for %s: needed %u bytes, buffer has %u bytes\n",
                  description,
                  static_cast<unsigned int>(used + valueLength + 1),
                  static_cast<unsigned int>(destinationSize));
    return false;
  }

  strlcat(destination, value, destinationSize);
  return true;
}

String topic(const char* suffix) {
  String full(kTopicPrefix);
  full += suffix;
  return full;
}

bool payloadEquals(const byte* payload, unsigned int length, const char* expected) {
  if (!expected) {
    return false;
  }
  const size_t expectedLength = strlen(expected);
  if (length != expectedLength) {
    return false;
  }
  for (unsigned int i = 0; i < length; ++i) {
    if (payload[i] != static_cast<byte>(expected[i])) {
      return false;
    }
  }
  return true;
}

void markTelemetryPublishCompleted() {
  telemetryPublishCompleted = true;
  telemetryPublishCompletedMs = millis();
  Serial.printf("Telemetry publish completed at %lu ms; post-telemetry awake window starts now\n",
                static_cast<unsigned long>(telemetryPublishCompletedMs));
}

void serviceMqttAndOta() {
  ArduinoOTA.handle();
  mqttClient.loop();
}

void waitWithMqttAndOta(uint32_t durationMs, const char* description) {
  if (durationMs == 0) {
    return;
  }

  Serial.printf("%s for %lu ms\n", description, static_cast<unsigned long>(durationMs));
  const uint32_t started = millis();
  while (millis() - started < durationMs) {
    serviceMqttAndOta();
    delay(10);
  }
  Serial.printf("%s complete\n", description);
}

void waitForPostTelemetryAwakeWindow() {
  if (!telemetryPublishCompleted) {
    Serial.println("Telemetry publish was not completed; skipping post-telemetry awake wait");
    return;
  }

  const uint32_t elapsedMs = millis() - telemetryPublishCompletedMs;
  if (elapsedMs >= kPostTelemetryAwakeMs) {
    Serial.printf("Post-telemetry awake window already satisfied: %lu/%lu ms\n",
                  static_cast<unsigned long>(elapsedMs),
                  static_cast<unsigned long>(kPostTelemetryAwakeMs));
    return;
  }

  const uint32_t remainingMs = kPostTelemetryAwakeMs - elapsedMs;
  Serial.printf("Waiting %lu ms to complete post-telemetry awake window (%lu/%lu ms elapsed)\n",
                static_cast<unsigned long>(remainingMs),
                static_cast<unsigned long>(elapsedMs),
                static_cast<unsigned long>(kPostTelemetryAwakeMs));
  waitWithMqttAndOta(remainingMs, "Post-telemetry awake window wait");
}

const char* resetReasonName(esp_reset_reason_t reason) {
  switch (reason) {
    case ESP_RST_POWERON:
      return "power-on";
    case ESP_RST_EXT:
      return "external";
    case ESP_RST_SW:
      return "software";
    case ESP_RST_PANIC:
      return "panic";
    case ESP_RST_INT_WDT:
      return "interrupt watchdog";
    case ESP_RST_TASK_WDT:
      return "task watchdog";
    case ESP_RST_WDT:
      return "watchdog";
    case ESP_RST_DEEPSLEEP:
      return "deep sleep";
    case ESP_RST_BROWNOUT:
      return "brownout";
    case ESP_RST_SDIO:
      return "SDIO";
    default:
      return "unknown";
  }
}

bool i2cAddressPresent(uint8_t address) {
  Wire.beginTransmission(address);
  return Wire.endTransmission() == 0;
}

void logExpectedDevice(uint8_t address, const char* name, bool present) {
  Serial.printf("I2C 0x%02X %-18s %s\n", address, name, present ? "present" : "MISSING");
}

void scanI2cBus() {
  logPhase("I2C scan");
  Serial.printf("I2C pins: SDA GPIO%u, SCL GPIO%u\n", kI2cSdaPin, kI2cSclPin);
  Serial.println("Expected devices:");
  Serial.printf("  0x%02X INA226 solar monitor\n", kSolarInaAddress);
  Serial.printf("  0x%02X INA226 battery monitor\n", kBatteryInaAddress);
  Serial.printf("  0x%02X SHT41/SHT4x sensor\n", kSht41Address);
  Serial.printf("  0x%02X BMP390/BMP3xx sensor\n", kBmp390Address);
  Serial.println("Scanning I2C bus now");

  uint8_t found = 0;
  for (uint8_t address = 1; address < 127; ++address) {
    if (i2cAddressPresent(address)) {
      Serial.printf("  found 0x%02X\n", address);
      ++found;
    }
  }
  if (found == 0) {
    Serial.println("  no I2C devices detected");
  }

  devices.solarInaPresent = i2cAddressPresent(kSolarInaAddress);
  devices.batteryInaPresent = i2cAddressPresent(kBatteryInaAddress);
  devices.sht41Present = i2cAddressPresent(kSht41Address);
  devices.bmp390Present = i2cAddressPresent(kBmp390Address);

  logExpectedDevice(kSolarInaAddress, "INA226 solar", devices.solarInaPresent);
  logExpectedDevice(kBatteryInaAddress, "INA226 battery", devices.batteryInaPresent);
  logExpectedDevice(kSht41Address, "SHT41/SHT4x", devices.sht41Present);
  logExpectedDevice(kBmp390Address, "BMP390/BMP3xx", devices.bmp390Present);
  Serial.printf(
      "I2C expected-device summary: solar=%s battery=%s sht4x=%s bmp3xx=%s\n",
      yesNo(devices.solarInaPresent),
      yesNo(devices.batteryInaPresent),
      yesNo(devices.sht41Present),
      yesNo(devices.bmp390Present));
}

void configureBmp390AfterInit() {
  bmp.setTemperatureOversampling(BMP3_OVERSAMPLING_16X);
  bmp.setPressureOversampling(BMP3_OVERSAMPLING_32X);
  bmp.setIIRFilterCoeff(BMP3_IIR_FILTER_COEFF_15);
  Serial.println("BMP390/BMP3xx initialized with pressure 32x, temperature 16x, IIR 16x");
  // The BMP3XX first sample after startup may be inaccurate; discard it before publishing.
  if (bmp.performReading()) {
    Serial.printf("BMP390/BMP3xx warm-up discard: temperature %.2f C, pressure %.2f hPa\n",
                  bmp.temperature,
                  bmp.pressure / 100.0f);
  } else {
    Serial.println("BMP390/BMP3xx warm-up discard read failed");
  }
  Serial.printf("Waiting %lu ms after BMP390/BMP3xx warm-up discard\n",
                static_cast<unsigned long>(kBmp390WarmupDiscardDelayMs));
  delay(kBmp390WarmupDiscardDelayMs);
}

void initializeBmp390() {
  devices.bmp390Ready = false;
  devices.bmp390Issue = nullptr;

