Niklaus1911/esp32-meteo/src/main.cpp
  for (uint8_t attempt = 1; attempt <= kBmp390InitAttempts; ++attempt) {
    devices.bmp390Present = i2cAddressPresent(kBmp390Address);
    if (!devices.bmp390Present) {
      Serial.printf("BMP390/BMP3xx not present at 0x%02X on init attempt %u/%u\n",
                    kBmp390Address,
                    attempt,
                    kBmp390InitAttempts);
    } else {
      Serial.printf("Initializing BMP390/BMP3xx at 0x%02X, attempt %u/%u\n",
                    kBmp390Address,
                    attempt,
                    kBmp390InitAttempts);
      devices.bmp390Ready = bmp.begin_I2C(kBmp390Address, &Wire);
      if (devices.bmp390Ready) {
        devices.bmp390Issue = nullptr;
        configureBmp390AfterInit();
        return;
      }
      Serial.printf("BMP390/BMP3xx initialization failed on attempt %u/%u\n", attempt, kBmp390InitAttempts);
    }

    if (attempt < kBmp390InitAttempts) {
      Serial.printf("Waiting %lu ms before BMP390/BMP3xx init retry\n",
                    static_cast<unsigned long>(kBmp390InitRetryDelayMs));
      delay(kBmp390InitRetryDelayMs);
    }
  }

  if (!devices.bmp390Present) {
    devices.bmp390Issue = "bmp3xx_missing";
    Serial.printf("Skipping BMP390/BMP3xx init because 0x%02X is missing after retries\n", kBmp390Address);
  } else {
    devices.bmp390Issue = "bmp3xx_init_failed";
    Serial.println("BMP390/BMP3xx initialization failed after retries");
  }
}

void initializeSensors() {
  logPhase("Sensor initialization");
  initializeBmp390();

  if (devices.sht41Present) {
    Serial.printf("Initializing SHT41/SHT4x at 0x%02X\n", kSht41Address);
    devices.sht41Ready = sht4.begin(&Wire);
    if (devices.sht41Ready) {
      devices.sht41Issue = nullptr;
      sht4.setPrecision(SHT4X_HIGH_PRECISION);
      sht4.setHeater(SHT4X_NO_HEATER);
      Serial.println("SHT41/SHT4x initialized with high precision and heater off");
    } else {
      devices.sht41Issue = "sht4x_init_failed";
      Serial.println("SHT41/SHT4x initialization failed");
    }
  } else {
    devices.sht41Issue = "sht4x_missing";
    Serial.printf("Skipping SHT41/SHT4x init because 0x%02X is missing\n", kSht41Address);
  }

  if (devices.solarInaPresent) {
    Serial.printf("Initializing solar INA226 at 0x%02X, shunt %.3f ohm, max current %.2f A\n",
                  kSolarInaAddress,
                  kInaShuntOhms,
                  kSolarMaxCurrentA);
    devices.solarInaReady = solarIna.init();
    if (devices.solarInaReady) {
      devices.solarInaIssue = nullptr;
      solarIna.setResistorRange(kInaShuntOhms, kSolarMaxCurrentA);
      solarIna.waitUntilConversionCompleted();
      Serial.println("Solar INA226 initialized");
    } else {
      devices.solarInaIssue = "solar_ina226_init_failed";
      Serial.println("Solar INA226 initialization failed");
    }
  } else {
    devices.solarInaIssue = "solar_ina226_missing";
    Serial.printf("Skipping solar INA226 init because 0x%02X is missing\n", kSolarInaAddress);
  }

  if (devices.batteryInaPresent) {
    Serial.printf("Initializing battery INA226 at 0x%02X, shunt %.3f ohm, max current %.2f A\n",
                  kBatteryInaAddress,
                  kInaShuntOhms,
                  kBatteryMaxCurrentA);
    devices.batteryInaReady = batteryIna.init();
    if (devices.batteryInaReady) {
      devices.batteryInaIssue = nullptr;
      batteryIna.setResistorRange(kInaShuntOhms, kBatteryMaxCurrentA);
      batteryIna.waitUntilConversionCompleted();
      Serial.println("Battery INA226 initialized");
    } else {
      devices.batteryInaIssue = "battery_ina226_init_failed";
      Serial.println("Battery INA226 initialization failed");
    }
  } else {
    devices.batteryInaIssue = "battery_ina226_missing";
    Serial.printf("Skipping battery INA226 init because 0x%02X is missing\n", kBatteryInaAddress);
  }

  Serial.printf(
      "Sensor readiness summary: solar=%s battery=%s sht4x=%s bmp3xx=%s\n",
      yesNo(devices.solarInaReady),
      yesNo(devices.batteryInaReady),
      yesNo(devices.sht41Ready),
      yesNo(devices.bmp390Ready));

  Serial.printf("Waiting %lu ms for sensors to settle after initialization\n",
                static_cast<unsigned long>(kSensorPostInitSettleDelayMs));
  delay(kSensorPostInitSettleDelayMs);
}

float batteryLevelPercent(float voltage) {
  if (isnan(voltage)) {
    return NAN;
  }

  const BatteryCurve curve = activeBatteryCurve();
  if (voltage <= curve.points[0].voltage) {
    return 0.0f;
  }

  if (voltage >= curve.points[curve.pointCount - 1].voltage) {
    return 100.0f;
  }

  for (size_t i = 1; i < curve.pointCount; ++i) {
    const BatteryCurvePoint& lower = curve.points[i - 1];
    const BatteryCurvePoint& upper = curve.points[i];
    if (voltage <= upper.voltage) {
      const float ratio = (voltage - lower.voltage) / (upper.voltage - lower.voltage);
      return lower.percent + ratio * (upper.percent - lower.percent);
    }
  }
  return 100.0f;
}

BatteryCurve activeBatteryCurve() {
  if (BATTERY_CHEMISTRY_ID == kBatteryChemistryLiFePO4) {
    return {kLiFePO4BatteryCurve, sizeof(kLiFePO4BatteryCurve) / sizeof(kLiFePO4BatteryCurve[0])};
  }
  if (BATTERY_CHEMISTRY_ID == kBatteryChemistryLiIon) {
    return {kLiIonBatteryCurve, sizeof(kLiIonBatteryCurve) / sizeof(kLiIonBatteryCurve[0])};
  }
  return {kLiIonBatteryCurve, sizeof(kLiIonBatteryCurve) / sizeof(kLiIonBatteryCurve[0])};
}

void logIna226ReadDiagnostics(INA226_WE& monitor, const char* name) {
  monitor.readAndClearFlags();
  if (monitor.overflow) {
    Serial.printf("%s INA226 diagnostic: math overflow flag was set\n", name);
  }
  const uint8_t i2cError = monitor.getI2cErrorCode();
  if (i2cError != 0) {
    Serial.printf("%s INA226 diagnostic: I2C error code %u while reading flags\n", name, i2cError);
  }
}

Reading readSensors() {
  logPhase("Sensor read");
  Reading reading;

  if (devices.bmp390Ready) {
    if (bmp.performReading()) {
      reading.bmpTemperatureC = bmp.temperature;
      reading.absolutePressureHpa = bmp.pressure / 100.0f;
      Serial.printf("BMP390/BMP3xx: temperature %.2f C, pressure %.2f hPa\n",
                    reading.bmpTemperatureC,
                    reading.absolutePressureHpa);
    } else {
      Serial.println("BMP390/BMP3xx read failed");
    }
  } else {
    Serial.println("BMP390/BMP3xx skipped: not ready");
  }

  if (devices.sht41Ready) {
    sensors_event_t humidity;
    sensors_event_t temperature;
    if (sht4.getEvent(&humidity, &temperature)) {
      reading.outsideTemperatureC = temperature.temperature;
      reading.outsideHumidityPercent = humidity.relative_humidity;
      Serial.printf("SHT41/SHT4x: temperature %.2f C, humidity %.2f %%\n",
                    reading.outsideTemperatureC,
                    reading.outsideHumidityPercent);
    } else {
      Serial.println("SHT41/SHT4x read failed");
    }
  } else {
    Serial.println("SHT41/SHT4x skipped: not ready");
  }

  if (devices.batteryInaReady) {
    logIna226ReadDiagnostics(batteryIna, "Battery");
    // Current sign depends on physical INA226 shunt orientation; correct after hardware verification if needed.
    reading.batteryVoltageV = batteryIna.getBusVoltage_V();
    reading.batteryCurrentMa = batteryIna.getCurrent_mA();
    reading.batteryPowerW = batteryIna.getBusPower() / 1000.0f;
    reading.batteryLevelPercent = batteryLevelPercent(reading.batteryVoltageV);
    Serial.printf("Battery INA226 (%s): voltage %.3f V, current %.2f mA, power %.3f W, level %.1f %%\n",
                  BATTERY_CHEMISTRY_NAME,
                  reading.batteryVoltageV,
                  reading.batteryCurrentMa,
                  reading.batteryPowerW,
                  reading.batteryLevelPercent);
  } else {
    Serial.println("Battery INA226 skipped: not ready");
  }

  if (devices.solarInaReady) {
    logIna226ReadDiagnostics(solarIna, "Solar");
    // Current sign depends on physical INA226 shunt orientation; correct after hardware verification if needed.
    reading.solarRawVoltageV = solarIna.getBusVoltage_V();
    reading.solarPanelCurrentMa = solarIna.getCurrent_mA();
    reading.solarRawPowerW = solarIna.getBusPower() / 1000.0f;
    Serial.printf("Solar INA226: voltage %.3f V, current %.2f mA, power %.3f W\n",
                  reading.solarRawVoltageV,
                  reading.solarPanelCurrentMa,
                  reading.solarRawPowerW);
  } else {
    Serial.println("Solar INA226 skipped: not ready");
  }

