Niklaus1911/esp32-meteo/src/main.cpp
  return reading;
}

bool configureStaticWifiIp() {
  if (!kWifiHasStaticIp) {
    Serial.println("WiFi static IP not configured; using DHCP");
    return true;
  }

  IPAddress localIp;
  IPAddress gateway;
  IPAddress subnet;

  if (!localIp.fromString(kWifiStaticIp) || !gateway.fromString(kWifiGateway) || !subnet.fromString(WIFI_SUBNET)) {
    Serial.println("WiFi static IP constants are invalid; falling back to DHCP");
    return false;
  }

  const bool configured = WiFi.config(localIp, gateway, subnet);
  Serial.printf("WiFi static IP config %s, IP %s, gateway %s, subnet %s\n",
                configured ? "applied" : "FAILED",
                localIp.toString().c_str(),
                gateway.toString().c_str(),
                subnet.toString().c_str());
  return configured;
}

bool connectWifiSlot(const char* slotName, const char* ssid, const char* password) {
  Serial.printf("Connecting to WiFi %s slot with timeout %lu ms\n",
                slotName,
                static_cast<unsigned long>(kWifiConnectTimeoutMs));
  Serial.println("WiFi password will not be printed");

  WiFi.begin(ssid, password);

  const uint32_t started = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - started < kWifiConnectTimeoutMs) {
    delay(kWifiRetryDelayMs);
    Serial.print('.');
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("WiFi %s slot failed after %lu ms, status=%d\n",
                  slotName,
                  static_cast<unsigned long>(millis() - started),
                  WiFi.status());
    WiFi.disconnect(false);
    delay(250);
    return false;
  }

  Serial.printf("WiFi %s slot connected in %lu ms, RSSI %d dBm, IP %s\n",
                slotName,
                static_cast<unsigned long>(millis() - started),
                WiFi.RSSI(),
                WiFi.localIP().toString().c_str());
  return true;
}

bool connectWifi() {
  logPhase("WiFi");
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);
  WiFi.setTxPower(kWifiTxPower);
  Serial.printf("WiFi TX power requested: %s\n", kWifiTxPowerLabel);
  configureStaticWifiIp();

  Serial.println("WiFi credentials loaded from generated header");
  if (connectWifiSlot("primary", WIFI_PRIMARY_SSID, WIFI_PRIMARY_PASSWORD)) {
    return true;
  }

  if (WIFI_HAS_BACKUP) {
    Serial.println("Primary WiFi failed; trying backup WiFi slot");
    return connectWifiSlot("backup", WIFI_BACKUP_SSID, WIFI_BACKUP_PASSWORD);
  }

  Serial.println("Primary WiFi failed and no backup WiFi slot is configured");
  return false;
}

void initializeOta() {
  logPhase("OTA");
  ArduinoOTA.setHostname(kOtaHostname);
  ArduinoOTA.setPassword(OTA_PASSWORD);

  ArduinoOTA.onStart([]() {
    otaInProgress = true;
    Serial.println("OTA update started; deep sleep is blocked until update finishes");
    if (mqttClient.connected()) {
      mqttClient.publish(kStatusTopic, "ota_updating", true);
    }
  });

  ArduinoOTA.onEnd([]() {
    Serial.println();
    Serial.println("OTA update finished; ESP32 will reboot");
    otaInProgress = false;
  });

  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    if (total == 0) {
      return;
    }
    static uint8_t lastPercent = 255;
    const uint8_t percent = static_cast<uint8_t>((progress * 100U) / total);
    if (percent != lastPercent && percent % 10 == 0) {
      Serial.printf("OTA progress: %u%%\n", percent);
      lastPercent = percent;
    }
  });

  ArduinoOTA.onError([](ota_error_t error) {
    otaInProgress = false;
    Serial.printf("OTA error %u: ", error);
    if (error == OTA_AUTH_ERROR) {
      Serial.println("auth failed");
    } else if (error == OTA_BEGIN_ERROR) {
      Serial.println("begin failed");
    } else if (error == OTA_CONNECT_ERROR) {
      Serial.println("connect failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      Serial.println("receive failed");
    } else if (error == OTA_END_ERROR) {
      Serial.println("end failed");
    } else {
      Serial.println("unknown");
    }
  });

  ArduinoOTA.begin();
  Serial.printf("ArduinoOTA ready, hostname %s, IP %s\n", kOtaHostname, WiFi.localIP().toString().c_str());
  Serial.println("OTA password loaded from generated header and will not be printed");
}

bool parseStayAwakePayload(const char* payload, size_t length, bool& value) {
  String normalized;
  normalized.reserve(length);
  for (size_t i = 0; i < length; ++i) {
    if (!isspace(static_cast<unsigned char>(payload[i]))) {
      normalized += static_cast<char>(tolower(static_cast<unsigned char>(payload[i])));
    }
  }

  if (normalized == "true" || normalized == "on" || normalized == "1" || normalized == "yes") {
    value = true;
    return true;
  }
  if (normalized == "false" || normalized == "off" || normalized == "0" || normalized == "no") {
    value = false;
    return true;
  }
  return false;
}

void mqttCallback(char* receivedTopic, byte* payload, unsigned int length) {
  if (strcmp(receivedTopic, kHaStatusTopic) == 0) {
    bool isHomeAssistantOnline = length == 6;
    const char expected[] = "online";
    for (unsigned int i = 0; isHomeAssistantOnline && i < length; ++i) {
      isHomeAssistantOnline = payload[i] == expected[i];
    }

    if (isHomeAssistantOnline) {
      Serial.println("Home Assistant announced online; discovery republish queued");
      homeAssistantDiscoveryRequested = true;
    }
    return;
  }

  if (strcmp(receivedTopic, kStatusTopic) == 0) {
    if (statusConfirmationPending && payloadEquals(payload, length, statusConfirmationExpected)) {
      statusConfirmationReceived = true;
      Serial.printf("MQTT status confirmation received on %s: %s\n",
                    kStatusTopic,
                    statusConfirmationExpected);
    } else if (statusConfirmationPending) {
      Serial.printf("MQTT status confirmation ignored on %s: payload length=%u, expected=%s\n",
                    kStatusTopic,
                    length,
                    statusConfirmationExpected ? statusConfirmationExpected : "(none)");
    }
    return;
  }

  if (strcmp(receivedTopic, kStayAwakeTopic) != 0) {
    return;
  }

  bool parsedValue = false;
  if (parseStayAwakePayload(reinterpret_cast<const char*>(payload), length, parsedValue)) {
    stayAwakeRequested = parsedValue;
    stayAwakeCommandReceived = true;
    Serial.printf("Stay-awake command received on %s: %s\n",
                  kStayAwakeTopic,
                  stayAwakeRequested ? "true" : "false");
  } else {
    Serial.printf("Ignoring invalid stay-awake command payload on %s, length=%u\n", kStayAwakeTopic, length);
  }
}

bool connectMqtt() {
  logPhase("MQTT");
  mqttClient.setServer(MQTT_HOST, MQTT_PORT);
  mqttClient.setCallback(mqttCallback);
  const bool bufferConfigured = mqttClient.setBufferSize(kMqttBufferSize);

  Serial.printf("MQTT server: %s:%u\n", MQTT_HOST, MQTT_PORT);
  Serial.printf("MQTT buffer size %u bytes: %s\n",
                static_cast<unsigned int>(kMqttBufferSize),
                bufferConfigured ? "ok" : "FAILED");
  Serial.printf("MQTT client ID prefix: %s\n", kTopicPrefix);
  Serial.printf("MQTT status topic: %s\n", kStatusTopic);
  Serial.printf("MQTT stay-awake topic: %s\n", kStayAwakeTopic);
  if (!bufferConfigured) {
    return false;
  }
  Serial.printf("Connecting to MQTT with timeout %lu ms\n", static_cast<unsigned long>(kMqttConnectTimeoutMs));
  const uint32_t started = millis();
  uint8_t attempt = 0;
  while (!mqttClient.connected() && millis() - started < kMqttConnectTimeoutMs) {
    ++attempt;
    const String clientId = String(kTopicPrefix) + "-" + String(static_cast<uint32_t>(ESP.getEfuseMac()), HEX);
    Serial.printf("MQTT connect attempt %u using client ID %s\n", attempt, clientId.c_str());
    if (mqttClient.connect(clientId.c_str(), MQTT_USERNAME, MQTT_PASSWORD)) {
      Serial.printf("MQTT connected in %lu ms\n", static_cast<unsigned long>(millis() - started));
      const bool statusPublished = mqttClient.publish(kStatusTopic, "online", true);
      Serial.printf("MQTT publish %s = online retained: %s\n", kStatusTopic, statusPublished ? "ok" : "FAILED");
      const bool subscribed = mqttClient.subscribe(kStayAwakeTopic, 1);
      Serial.printf("MQTT subscribe %s qos=1: %s\n", kStayAwakeTopic, subscribed ? "ok" : "FAILED");
      if (!subscribed) {
        return false;
      }
      waitForRetainedStayAwakeCommand();
      const bool haSubscribed = mqttClient.subscribe(kHaStatusTopic, 0);
      Serial.printf("MQTT subscribe %s qos=0: %s\n", kHaStatusTopic, haSubscribed ? "ok" : "FAILED");
      if (!haSubscribed) {
        return false;
      }
      publishHomeAssistantDiscovery();
      return true;
    }

