Niklaus1911/esp32-meteo/src/main.cpp
    Serial.printf("MQTT connect failed, rc=%d\n", mqttClient.state());
    delay(kMqttRetryDelayMs);
  }

  Serial.println("MQTT connection failed");
  return false;
}

void publishFloat(const char* suffix, float value) {
  const String fullTopic = topic(suffix);
  if (isnan(value) || isinf(value)) {
    Serial.printf("MQTT skip %s: invalid reading\n", fullTopic.c_str());
    return;
  }

  char payload[24];
  dtostrf(value, 0, 8, payload);
  const bool ok = mqttClient.publish(fullTopic.c_str(), payload, true);
  Serial.printf("MQTT publish %s = %s retained: %s\n", fullTopic.c_str(), payload, ok ? "ok" : "FAILED");
}

void publishText(const char* suffix, const char* value, bool retained = true) {
  const String fullTopic = topic(suffix);
  const bool ok = mqttClient.publish(fullTopic.c_str(), value, retained);
  Serial.printf("MQTT publish %s = %s retained=%s: %s\n",
                fullTopic.c_str(),
                value,
                retained ? "true" : "false",
                ok ? "ok" : "FAILED");
}

void publishDiscoveryPayload(const char* component, const char* objectId, const char* payload) {
  char discoveryTopic[160];
  if (!formatInto(discoveryTopic,
                  sizeof(discoveryTopic),
                  "Home Assistant discovery topic",
                  "%s/%s/%s/config",
                  kHaDiscoveryPrefix,
                  component,
                  objectId)) {
    Serial.printf("HA discovery skipped for %s/%s: topic too long\n", component, objectId);
    return;
  }

  const size_t payloadLength = strlen(payload);
  const size_t packetBytes = kMqttMaxHeaderBytes + 2 + strlen(discoveryTopic) + payloadLength;
  Serial.printf("HA discovery payload %s: payload=%u bytes, packet_estimate=%u/%u bytes\n",
                discoveryTopic,
                static_cast<unsigned int>(payloadLength),
                static_cast<unsigned int>(packetBytes),
                static_cast<unsigned int>(kMqttBufferSize));
  if (packetBytes > kMqttBufferSize) {
    Serial.printf("HA discovery skipped %s: MQTT packet estimate exceeds buffer\n", discoveryTopic);
    return;
  }

  const bool ok = mqttClient.publish(discoveryTopic, payload, true);
  Serial.printf("HA discovery publish %s retained: %s\n", discoveryTopic, ok ? "ok" : "FAILED");
}

void publishHaSensorDiscovery(const char* objectId,
                              const char* name,
                              const char* stateTopic,
                              const char* deviceClass,
                              const char* unit,
                              const char* stateClass,
                              const char* entityCategory) {
  char payload[1024];
  char optionalFields[260] = "";

  if (deviceClass && deviceClass[0]) {
    char field[64];
    if (!formatInto(field, sizeof(field), "HA sensor device_class field", ",\"device_class\":\"%s\"", deviceClass) ||
        !appendChecked(optionalFields, sizeof(optionalFields), "HA sensor optional fields", field)) {
      Serial.printf("HA discovery skipped for %s: optional device_class too long\n", objectId);
      return;
    }
  }
  if (unit && unit[0]) {
    char field[64];
    if (!formatInto(field, sizeof(field), "HA sensor unit field", ",\"unit_of_measurement\":\"%s\"", unit) ||
        !appendChecked(optionalFields, sizeof(optionalFields), "HA sensor optional fields", field)) {
      Serial.printf("HA discovery skipped for %s: optional unit too long\n", objectId);
      return;
    }
  }
  if (stateClass && stateClass[0]) {
    char field[64];
    if (!formatInto(field, sizeof(field), "HA sensor state_class field", ",\"state_class\":\"%s\"", stateClass) ||
        !appendChecked(optionalFields, sizeof(optionalFields), "HA sensor optional fields", field)) {
      Serial.printf("HA discovery skipped for %s: optional state_class too long\n", objectId);
      return;
    }
  }
  if (entityCategory && entityCategory[0]) {
    char field[80];
    if (!formatInto(field, sizeof(field), "HA sensor entity_category field", ",\"entity_category\":\"%s\"", entityCategory) ||
        !appendChecked(optionalFields, sizeof(optionalFields), "HA sensor optional fields", field)) {
      Serial.printf("HA discovery skipped for %s: optional entity_category too long\n", objectId);
      return;
    }
  }

  if (!formatInto(payload,
                  sizeof(payload),
                  "HA sensor discovery payload",
                  "{\"name\":\"%s\",\"unique_id\":\"%s\",\"state_topic\":\"%s\"%s,"
                  "\"device\":{\"identifiers\":[\"%s\"],\"name\":\"%s\",\"manufacturer\":\"%s\",\"model\":\"%s\",\"sw_version\":\"%s\"},"
                  "\"origin\":{\"name\":\"%s\",\"sw_version\":\"%s\"}}",
                  name,
                  objectId,
                  stateTopic,
                  optionalFields,
                  kHaDeviceIdentifier,
                  kHaDeviceName,
                  kHaManufacturer,
                  kHaModel,
                  kFirmwareName,
                  kFirmwareName,
                  kFirmwareName)) {
    Serial.printf("HA discovery skipped for %s: payload too long\n", objectId);
    return;
  }

  publishDiscoveryPayload("sensor", objectId, payload);
}

bool formatHaObjectId(char* buffer, size_t bufferSize, const char* suffix) {
  return formatInto(buffer, bufferSize, "HA discovery object id", "%s_%s", kHaUniqueIdPrefix, suffix);
}

void publishPrefixedHaSensorDiscovery(const char* objectSuffix,
                                      const char* name,
                                      const char* stateTopic,
                                      const char* deviceClass,
                                      const char* unit,
                                      const char* stateClass,
                                      const char* entityCategory) {
  char objectId[96];
  if (!formatHaObjectId(objectId, sizeof(objectId), objectSuffix)) {
    Serial.printf("HA discovery skipped for %s: object id too long\n", objectSuffix);
    return;
  }

