Niklaus1911/esp32-meteo/src/main.cpp
const char* readinessText(bool ready, const char* issue) {
  if (ready) {
    return "ready";
  }
  if (issue && issue[0]) {
    return issue;
  }
  return "unknown";
}

void publishDiagnostics() {
  Serial.println("Publishing diagnostics");
  char rssi[16];
  snprintf(rssi, sizeof(rssi), "%d", WiFi.RSSI());
  publishText("/diagnostic/wifi_signal", rssi);
  const String wifiSsid = WiFi.SSID();
  publishText("/diagnostic/wifi_ssid", wifiSsid.c_str());
  const String ipAddress = WiFi.localIP().toString();
  publishText("/diagnostic/ip_address", ipAddress.c_str());
  publishText("/diagnostic/reset_reason", resetReasonName(esp_reset_reason()));
  publishText("/diagnostic/battery_chemistry", BATTERY_CHEMISTRY_NAME);

  char sensorReadiness[160];
  if (formatInto(sensorReadiness,
                 sizeof(sensorReadiness),
                 "sensor readiness diagnostic",
                 "solar=%s battery=%s sht4x=%s bmp3xx=%s",
                 readinessText(devices.solarInaReady, devices.solarInaIssue),
                 readinessText(devices.batteryInaReady, devices.batteryInaIssue),
                 readinessText(devices.sht41Ready, devices.sht41Issue),
                 readinessText(devices.bmp390Ready, devices.bmp390Issue))) {
    publishText("/diagnostic/sensor_readiness", sensorReadiness);
  }
}

void appendDegradedIssue(String& status, bool& degraded, const char* issue) {
  if (!issue || !issue[0]) {
    return;
  }
  if (!degraded) {
    status += "; degraded:";
    degraded = true;
  }
  status += ' ';
  status += issue;
}

void publishDeviceStatus() {
  String status = "online";
  bool degraded = false;
  appendDegradedIssue(status, degraded, devices.solarInaIssue);
  appendDegradedIssue(status, degraded, devices.batteryInaIssue);
  appendDegradedIssue(status, degraded, devices.sht41Issue);
  appendDegradedIssue(status, degraded, devices.bmp390Issue);
  const bool ok = mqttClient.publish(kStatusTopic, status.c_str(), true);
  Serial.printf("MQTT publish %s = %s retained: %s\n", kStatusTopic, status.c_str(), ok ? "ok" : "FAILED");
}

void publishReadings() {
  logPhase("MQTT publish cycle");
  Reading reading = readSensors();

  publishFloat("/sensor/bmp390_temperature", reading.bmpTemperatureC);
  publishFloat("/sensor/absolute_pressure", reading.absolutePressureHpa);
  publishFloat("/sensor/outside_temperature", reading.outsideTemperatureC);
  publishFloat("/sensor/outside_humidity", reading.outsideHumidityPercent);
  publishFloat("/sensor/battery_voltage", reading.batteryVoltageV);
  publishFloat("/sensor/battery_current", reading.batteryCurrentMa);
  publishFloat("/sensor/battery_power", reading.batteryPowerW);
  publishFloat("/sensor/battery_level", reading.batteryLevelPercent);
  publishFloat("/sensor/solar_raw_voltage", reading.solarRawVoltageV);
  publishFloat("/sensor/solar_panel_current", reading.solarPanelCurrentMa);
  publishFloat("/sensor/solar_raw_power", reading.solarRawPowerW);
  publishDiagnostics();
  publishDeviceStatus();
  flushMqtt(kTelemetryFlushMs);
  markTelemetryPublishCompleted();
}

void flushMqtt(uint32_t durationMs) {
  Serial.printf("Flushing MQTT for %lu ms\n", static_cast<unsigned long>(durationMs));
  const uint32_t started = millis();
  while (millis() - started < durationMs) {
    serviceMqttAndOta();
    delay(10);
  }
  Serial.println("MQTT flush complete");
}

bool publishRetainedStatusAndWaitForEcho(const char* payload, uint32_t timeoutMs) {
  statusConfirmationExpected = payload;
  statusConfirmationReceived = false;
  statusConfirmationPending = true;

  const bool statusOk = mqttClient.publish(kStatusTopic, payload, true);
  Serial.printf("MQTT publish %s = %s retained: %s\n",
                kStatusTopic,
                payload,
                statusOk ? "ok" : "FAILED");
  if (!statusOk) {
    statusConfirmationPending = false;
    statusConfirmationExpected = nullptr;
    return false;
  }

  if (!statusConfirmationSubscribed) {
    const bool subscribed = mqttClient.subscribe(kStatusTopic, 0);
    Serial.printf("MQTT subscribe %s qos=0 for status confirmation: %s\n",
                  kStatusTopic,
                  subscribed ? "ok" : "FAILED");
    statusConfirmationSubscribed = subscribed;
    if (!subscribed) {
      statusConfirmationPending = false;
      statusConfirmationExpected = nullptr;
      return false;
    }
  }

  Serial.printf("Waiting up to %lu ms for broker echo of %s = %s\n",
                static_cast<unsigned long>(timeoutMs),
                kStatusTopic,
                payload);
  const uint32_t started = millis();
  while (!statusConfirmationReceived && mqttClient.connected() && millis() - started < timeoutMs) {
    serviceMqttAndOta();
    delay(10);
  }

  const bool confirmed = statusConfirmationReceived;
  statusConfirmationPending = false;
  statusConfirmationExpected = nullptr;
  Serial.printf("MQTT broker echo for %s = %s: %s\n",
                kStatusTopic,
                payload,
                confirmed ? "confirmed" : "not confirmed");
  return confirmed;
}

bool publishSleepStatusWithConfirmation() {
  for (uint8_t attempt = 1; attempt <= kSleepStatusConfirmAttempts; ++attempt) {
    Serial.printf("Publishing sleeping status with broker confirmation, attempt %u/%u\n",
                  attempt,
                  kSleepStatusConfirmAttempts);
    if (publishRetainedStatusAndWaitForEcho("sleeping", kSleepStatusConfirmTimeoutMs)) {
      return true;
    }

    if (attempt < kSleepStatusConfirmAttempts) {
      waitWithMqttAndOta(kMqttRetryDelayMs, "Sleeping status confirmation retry wait");
    }
  }

  Serial.println("WARNING: MQTT broker did not confirm retained sleeping status; sleeping anyway to protect battery");
  return false;
}

void sleepForDefaultInterval(const char* reason) {
  logPhase("Deep sleep");
  while (otaInProgress) {
    Serial.println("OTA update in progress; delaying deep sleep");
    serviceMqttAndOta();
    delay(100);
  }

  Serial.printf("Preparing deep sleep for %llu seconds: %s\n", kDeepSleepSeconds, reason);
  waitForPostTelemetryAwakeWindow();

  if (mqttClient.connected()) {
    const bool sleepStatusConfirmed = publishSleepStatusWithConfirmation();
    if (sleepStatusConfirmed) {
      waitWithMqttAndOta(kPostSleepStatusGraceMs, "Post-sleep-status MQTT grace period");
    }
    mqttClient.disconnect();
    Serial.println("MQTT disconnected");
  } else {
    Serial.println("MQTT not connected; skipping sleeping status publish");
  }
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  Serial.println("WiFi disconnected and radio turned off");
  esp_sleep_enable_timer_wakeup(kDeepSleepSeconds * 1000000ULL);
  Serial.println("Deep-sleep timer configured");
  Serial.printf("Entering deep sleep for %llu seconds now\n", kDeepSleepSeconds);
  Serial.flush();
  esp_deep_sleep_start();
}

void waitForRetainedStayAwakeCommand() {
  logPhase("Stay-awake command");
  Serial.println("MQTT commands cannot wake the ESP32 while it is already in deep sleep.");
  Serial.println("A retained stay-awake command will be applied after the next timer wake and MQTT reconnect.");

  if (kForceStayAwakeForTesting) {
    stayAwakeRequested = true;
    stayAwakeCommandReceived = true;
    Serial.println("Local force stay-awake flag is enabled; bypassing retained MQTT command wait");
    return;
  }

  Serial.printf("Waiting up to %lu ms for retained command on %s\n",
                static_cast<unsigned long>(kRetainedCommandWaitMs),
                kStayAwakeTopic);
  const uint32_t started = millis();
  while (!stayAwakeCommandReceived && millis() - started < kRetainedCommandWaitMs) {
    ArduinoOTA.handle();
    mqttClient.loop();
    delay(10);
  }

  if (!stayAwakeCommandReceived) {
    Serial.println("No retained stay-awake command received before timeout; defaulting to one publish then sleep");
  } else {
    Serial.printf("Retained stay-awake command applied: %s\n", stayAwakeRequested ? "true" : "false");
    Serial.printf("Stay-awake retained value means this boot will %s\n",
                  stayAwakeRequested ? "remain awake" : "return to deep sleep after publishing");
  }

  if (homeAssistantDiscoveryRequested) {
    publishHomeAssistantDiscovery();
  }
}

void appSetup() {
  Serial.begin(kSerialBaud);
  delay(200);
  setCpuFrequencyMhz(kCpuFrequencyMhz);

  Serial.println();
  Serial.printf("%s boot\n", kFirmwareName);
  Serial.printf("CPU frequency requested: %lu MHz, active: %u MHz\n",
                static_cast<unsigned long>(kCpuFrequencyMhz),
                getCpuFrequencyMhz());
  Serial.printf("Reset reason: %s\n", resetReasonName(esp_reset_reason()));
  Serial.printf("MQTT topic prefix: %s\n", kTopicPrefix);
  Serial.printf("Battery chemistry: %s (%s)\n", BATTERY_CHEMISTRY_NAME, BATTERY_CHEMISTRY_KEY);
  Serial.printf("Stay-awake publish interval: %lu ms\n", static_cast<unsigned long>(kStayAwakePublishIntervalMs));
  Serial.printf("Default deep sleep: %llu seconds\n", kDeepSleepSeconds);
  Serial.printf("Local force stay-awake flag: %s\n", kForceStayAwakeForTesting ? "enabled" : "disabled");
  Serial.println("Safety: I2C pullups must be tied to 3.3 V only.");
  Serial.println("Safety: charger chemistry, charge voltage, charge current, and protection must match the installed cell.");
  Serial.println("Safety: Li-ion charger output above about 4.25 V is unsafe/untrusted.");
  Serial.println("Safety: do not power the ESP32 3.3 V rail directly from LiFePO4; use a low-Iq regulator or buck-boost.");
  Serial.println("Safety: solar panel rating, TP5000 variant, charge current, and ESP32 regulator behavior are not assumed.");

  Wire.begin(kI2cSdaPin, kI2cSclPin);
  Serial.printf("Waiting %lu ms for I2C peripherals to stabilize after wake\n",
                static_cast<unsigned long>(kI2cPowerStabilizeDelayMs));
  delay(kI2cPowerStabilizeDelayMs);
  scanI2cBus();
  initializeSensors();

  if (!connectWifi()) {
    sleepForDefaultInterval("WiFi unavailable");
  }

