Niklaus1911/esp32-meteo/src/main.cpp
  initializeOta();

  if (!connectMqtt()) {
    sleepForDefaultInterval("MQTT unavailable");
  }

  Serial.printf("Waiting %lu ms before first sensor read after boot/wake\n",
                static_cast<unsigned long>(kBeforeFirstReadDelayMs));
  delay(kBeforeFirstReadDelayMs);
  publishReadings();
  lastPublishMs = millis();

  if (!stayAwakeRequested) {
    Serial.println("Stay-awake mode is disabled; device will sleep after first publish");
    sleepForDefaultInterval("stay_awake disabled or absent");
  }

  Serial.printf("Stay-awake mode enabled; publishing every %lu ms\n",
                static_cast<unsigned long>(kStayAwakePublishIntervalMs));
}

void appLoop() {
  if (WiFi.status() != WL_CONNECTED || !mqttClient.connected()) {
    Serial.printf("Connection lost while awake: wifi_status=%d mqtt_connected=%s\n",
                  WiFi.status(),
                  yesNo(mqttClient.connected()));
    sleepForDefaultInterval("connection lost");
  }

  mqttClient.loop();
  ArduinoOTA.handle();

  if (homeAssistantDiscoveryRequested) {
    publishHomeAssistantDiscovery();
  }

  if (!stayAwakeRequested) {
    Serial.println("Stay-awake changed to false while awake; publishing once before sleep");
    publishReadings();
    sleepForDefaultInterval("stay_awake disabled");
  }

  if (millis() - lastPublishMs >= kStayAwakePublishIntervalMs) {
    Serial.printf("Stay-awake publish interval reached after %lu ms\n",
                  static_cast<unsigned long>(millis() - lastPublishMs));
    publishReadings();
    lastPublishMs = millis();
  }

  delay(20);
}

}  // namespace

void setup() {
  appSetup();
}

void loop() {
  appLoop();
}
